package com.zhyan.shandiankuaiyunlib.Bean;

/**
 * Created by az on 2017/5/22.
 */

public class CompanyIntroduceBean {

    /**
     * status : 0
     * msg : 成功
     * content : {"id":"4","name":"闪电物流科技有限公司","iphone":"0577-62589122","wecat":"15967777888","qq":"","image1":null,"image2":null,"image3":null,"address":"浙江省乐清市","agree_ment":"                 闪电快运《用户服务协议》\r\n闪电快运（以下简称本服务）是由乐清闪电网络科技有限公司（以下简称本公司）向闪电快运用户提供的软件系统（以下简称本系统）及(或)附随的运费、保险费等费用代收代付的中介服务。本协议由您和本公司签订。\r\n一、 接受条款\r\n您在闪电快运（以下简称本网站）的注册、登录、使用等行为将视为对本协议的接受即表示您已经同意与乐清闪电网络科技有限公司订立本协议，且您将受本协议的条款和条件 (\u201c条款\u201d) 约束。本《协议》可由本公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，您可在本网站查阅最新版协议条款。在本公司修改《协议》条款后，如果您不接受修改后的条款，请立即停止使用闪电快运提供的服务，您继续使用闪电快运提供的服务将被视为已接受了修改后的协议。当您与本公司发生争议时，应以最新的\u201c条款\u201d为准。\r\n二、服务对象\r\n只有符合下列条件之一的自然人或法人才能申请成为本网站会员，可以享受本网站的服务： \r\n2.1拥有与经营性道路运输业务相适应并经道路运输管理机构检测合格的车辆； \r\n2.2从事货运经营的驾驶员须取得相应的机动车驾驶证且年龄不超过60周岁； \r\n2.3取得道路运输管理机构颁发的道路运输经营许可证和向投入运输的车辆配发的车辆营运证。 \r\n2.4从事危险货物运输经营的，须取得道路运输管理机构颁发的危险品道路运输经营许可证，驾驶员取得道路危险货物运输从业资格证。\r\n三、您的权利与义务\r\n3.1您及您的司机有权根据本协议及本网站发布的相关规则，利用闪电快运发布车源信息、查询货源信息、参与货源报价，参加本网站的有关活动及有权享受本网站提供的其他有关资讯及信息服务； \r\n3.2您须自行负责自己的会员账号和密码，且须对在会员账号密码下发生的所有活动（包括但不限于发布货源信息、网上点击同意各类协议、规则、选择车辆承运货物、电子钱包支付等）承担责任。会员有权根据需要更改登录密\r\n   码。因会员的过错导致的任何损失由会员自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，您使用的计算机被他人侵入； \r\n3.3您应当向本网站提供真实准确完整的注册信息，包括但不限于司机身份证、驾驶证和车辆行驶证、车辆运营证、车队挂靠合同等。同时，您的相关资料实际变更时及时更新有关注册资料。您进一步同意其一旦将信息或 \r\n   资料在使用服务时提供，则表示同意放弃对此信息或资料所享有的隐私权、版权和相关财产权利。 \r\n3.4您不得以任何形式擅自转让或授权他人使用自己在本网站的会员帐号； \r\n3.5您有义务确保在本网站上发布的车辆信息真实、准确无误，包括但不限于车辆的驾驶员； \r\n3.6您及您的司机对货源信息做出的报价，一旦中标，您不得以任何理由拒绝承运，包括但不限于嫌弃运费低、距离发货地较远无法在承诺的时间前往装车。 \r\n3.7在货源信息规定的期限内，您或您的司机须前往指定的地点提取货物，在装货过程中，驾驶员应负责进行监装，对装货过程中的不当操作有责任指出并纠正，装车完毕要求发货人开具具有法律效力的出库凭证随车带走；在货\r\n   源信息规定的期限内，将货物运到指定的地点和收货人完成交接，并要求其开具具有法律效力的入库凭证随车带走。对于货主需要返回原件签收单的，应以快递的方式将签收单原件第一时间邮寄给收件人。 \r\n3.8您对承运的货物负有安全责任，若违反以下条款，货主要求支付相应的违约金或由此造成其他损失时，由您自行承担全部赔偿责任： \r\n  （1）不按约定的时间和要求配车、发运，逾期达到。 \r\n  （2）将货物错运到卸货地点或收货人，应无偿运至合同规定的到货地点或收货人。 \r\n  （3）运输过程中货物灭失、短少、变质、污染、损坏，您应按货物的实际损失（包括包装费、运杂费）赔偿货主。在符合法律和协议规定条件下的运输，由于下列原因造成货物灭失、短少、变质、污染、损坏的，您不承担违\r\n       约责任： （1）不可抗力； （2）货物本身的自然属性； （3）货物的合理损耗； （4）货主或收货方本身的过错。 \r\n3.9您安全准时地将货物送达后有权获得运费，在运输途中发生的其他一切费用（包括但不限于过路、过桥费）全部由您负担； \r\n3.10您应当自行承担因交易产生或取得的相关费用，包括但不限于通讯及交易服务费，并依法纳税； \r\n3.11您在本网站交易中应当遵守诚实信用原则，不得以干预或操纵交易等不正当竞争方式扰乱网上交易秩序，不得从事与网上交易无关的不当行为； \r\n3.12您不应采取不正当手段（包括但不限于虚假需求、互换好评等方式）提高自身或他人信用度，或采用不正当手段恶意评价其他会员，降低其他会员信用度； \r\n3.13您承诺自己在使用本网站实施的所有行为遵守法律、法规、行政规章和本网站的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，您将自行独立承担相应的法律责任； \r\n3.14您在本网站网上交易过程中如与其他会员因交易产生纠纷，可以请求本网站从中予以协调处理。您如发现其他会员有违法或违反本协议的行为，可以向本网站举报； \r\n3.15您同意接收来自本网站的信息，包括但不限于活动信息、交易信息、促销信息等。 \r\n3.16您同意将手机的地理位置分享给本网站，本网站有权利在您与货主达成交易后，将你的手机位置开放给货主，以便货主与您放心交易。\r\n四、闪电物流网及其APP仅作为交易地点\r\n闪电快运网及APP仅作为用户物色交易对象、就服务的交易进行协商，以及获取各类相关服务的地点。但是，本公司不能控制交易所涉及的物品/服务的质量、安全或合法性，信息的真实性或准确性，以及交易方履行其在协议项下的各项义务的能力。本公司不能也不会控制交易各方能否履行协议义务。\r\n五、您的资料及交易物品\r\n\u201c您的资料\u201d包括您在注册、交易或列举物品/服务过程中向本公司或其他用户提供的任何资料，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。您应对\u201c您的资料\u201d负全部责任，而本公司仅作为您在网上发布和刊登\u201c您的资料\u201d的被动渠道。但是，倘若本公司认为\u201c您的资料\u201d可能使本公司承担任何法律或道义上的责任，或可能使本公司 (全部或部份地) 失去本公司的互联网服务供应商或其他供应商的服务，或您未在闪电物流规定的期限内登录或再次登录网站，则本公司可自行全权决定对\u201c您的资料\u201d采取本公司认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给闪电快运网的\u201c您的资料\u201d拥有全部权利，包括全部版权。您确认，闪电快运网没有责任去认定或决定您提交给本公司的资料哪些是应当受到保护的，对享有\u201c本服务\u201d的其他用户使用\u201c您的资料\u201d，本公司也不必负责。为了保证交易的安全进行，闪电快运有义务向货主提供车主在闪电快运网注册时提交的包括但不限于 行驶证、营运证、司机、车主及车辆照片。 \r\n5.1 注册义务 如您在闪电快运网注册，您同意：\r\n    (a) 根据闪电快运网刊载的会员资料表格的要求，提供关于您或贵公司的真实、准确、完整和反映当前情况的资料；\r\n    (b) 维持并及时更新会员资料，使其保持真实、准确、完整和反映当前情况。倘若您提供任何不真实、不准确、不完整或不能反映当前情况的资料，或省闪电物流网有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况，闪电快运网有权暂停或终止您的注册身份及资料，并拒绝您在目前或将来对\u201c服务\u201d(或其任何部份) 以任何形式使用。如您代表一家公司或其他法律主体在本公司登记，则您声明和保证，您有权使该公司或其他法律主体受本协议\u201c条款\u201d约束。 \r\n5.2 会员注册名、密码和保密 在登记过程中，您将选择会员注册名和密码。您须自行负责对您的会员注册名和密码保密，且须对您在会员注册名和密码下发生的所有活动承担责任。您同意：\r\n   (a) 如发现任何人未经授权使用您的会员注册名或密码，或发生违反保密规定的任何其他情况，您会立即通知闪电快运网； \r\n   (b) 确保您在每个上网时段结束时，以正确步骤离开网站。闪电快运网不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。 \r\n5.3 关于您的资料的规则 您同意，\u201c您的资料\u201d和您提供在闪电快运网上交易的任何\u201c物品\u201d（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据，或某种服务或行为。本协议中\u201c物品\u201d一词均含此义） \r\na. 不会有欺诈成份； \r\nb. 不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权； \r\nc. 不会违反任何法律、法规、条例或规章 (包括但不限于保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)； \r\nd. 不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容； \r\ne. 不会含有淫秽、或包含任何儿童色情内容； \r\nf. 不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序； \r\n此外，您同意不会：在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用\u201c本服务\u201d；未经其他人士同意，利用\u201c本服务\u201d收集其他人士的电话号码及其他资料；或利用\u201c本服务\u201d制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士。\r\n六、您授予本公司的许可使用权\r\n您授予本公司独家的、国内通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)，使本公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示\"您的资料\"或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将\"您的资料\"纳入其他作品内。\r\n七、隐私\r\n尽管有第5条所规定的许可使用权，本公司将仅根据本公司的隐私声明使用\u201c您的资料\u201d。本公司隐私声明的全部条款属于本协议的一部份，因此，您必须仔细阅读。请注意，您一旦自愿地在闪电快运网交易地点披露\u201c您的资料\u201d，该等资料即可能被其他人士获取和使用。您同意将手机的地理位置分享给本网站，本网站有权利在认为必要的时候开放给其他第三方。\r\n八、交易程序\r\n8.1 添加产品/服务描述条目 产品/服务描述是由您提供的在闪电物流网上展示的文字描述、图画和/或照片，可以是\r\n   (a) 对您拥有而您希望出售的产品/服务的描述；或 \r\n   (b) 对您正寻找的产品/服务的描述。您可在闪电快运网发布任一类产品/服务描述，或两种类型同时发布，条件是，您必须将该等产品/服务描述归入正确的类目内。闪电快运网不对产品/服务描述的准确性或内容负责。 \r\n8.2 就交易进行协商 交易各方通过在闪电快运网上明确描述报价和回复，进行相互协商。所有各方接纳报价或回复将使所涉及的闪电快运网用户有义务完成交易。除非在特殊情况下，诸如用户在您提出报价后实质性地更改对物品的描述或澄清任何文字输入错误，或您未能证实交易所涉及的用户的身份等，报盘和承诺均不得撤回。\r\n8.3 处理交易争议 本公司不会且不能牵涉进交易各方的交易当中。倘若您与一名或一名以上用户，或与您通过本公司网站获取其服务的第三者服务供应商发生争议，您免除闪电快运网 (及本公司代理人和雇员) 在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何 (实际和后果性的) 权利主张、要求和损害赔偿等方面的责任。\r\n8.4 运用常识 本公司不能亦不试图对其他用户通过\u201c本服务\u201d提供的资料进行控制。就其本质而言，其他用户的资料，可能是令人反感的、有害的或不准确的，且在某些情况下可能带有错误的标识说明或以欺诈方式加上标识说明。本公司希望您在使用本公司网站时，小心谨慎并运用常识。\r\n九、信息反馈\r\n9.1 反馈 您不得采取任何可能损害信息反馈系统的完整性的行动，诸如：利用第二会员身份标识或第三者为您本身留下正面反馈；利用第二会员身份标识或第三者为其他用户留下负面反馈 (反馈数据轰炸)；或在用户未能履行交易范围以外的某些行动时，留下负面的反馈 (反馈恶意强加)。 \r\n9.2 不作商业性利用 您同意，您不得对任何资料作商业性利用，包括但不限于在未经闪电快运网事先书面批准的情况下，复制在闪电快运网上展示任何资料。\r\n十、 终止或访问限制\r\n您同意，闪电快运网可自行全权决定以任何理由 (包括但不限于闪电快运认为您已违反本协议的字面意义和精神，或以不符合本协议的字面意义和精神的方式行事，或您在超过90天的时间内未以您的帐号及密码登录网站) 终止您的\u201c本服务\u201d密码、帐户 (或其任何部份) 或您对\u201c本服务\u201d的使用，并删除和丢弃您在使用\u201c本服务\u201d中提交的\u201c您的资料\u201d。闪电快运网同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供\u201c本服务\u201d或其任何部份。您同意，根据本协议的任何规定终止您使用\u201c本服务\u201d之措施可在不发出事先通知的情况下实施，并承认和同意，闪电快运网可立即使您的帐户无效，或撤销您的帐户以及在您的帐户内的所有相关资料和档案，和/或禁止您进一步接入该等档案或\u201c服本务\u201d。帐号终止后，闪电快运网没有义务为您保留原帐号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，闪电快运网不会就终止您接入\u201c本服务\u201d而对您或任何第三者承担任何责任。第11、12、13、20条应在本协议终止后继续有效。\r\n十一、 违反规则会有什么后果？\r\n11.1在不限制其他补救措施的前提下，发生下述任一情况，本公司可立即发出警告，暂时中止、永久中止或终止您的会员资格，删除您的任何现有信息，以及您在网站上展示的任何其他资料：\r\n    (i) 您违反本协议；\r\n(ii) 本公司无法核实或鉴定您向本公司提供的任何资料；或 \r\n(iii) 本公司相信您的行为可能会使您、本公司用户或通过本公司或本公司网站提供服务的第三者服务供应商发生任何法律责任。在不限制任何其他补救措施的前提下，倘若发现您从事涉及本公司网站的诈骗活动，闪电快运网可暂停或终止您的帐户。\r\n11.2服务\u201c按现状\u201d提供 本公司会尽一切努力使您在使用闪电快运网的过程中得到乐趣。遗憾的是，本公司不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用\u201c本服务\u201d的风险由您自行承担。\u201c本服务\u201d以\u201c按现状\u201d和\u201c按可得到\u201d的基础提供。闪电快运网明确声明不作出任何种类的所有明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。闪电快运网对下述内容不作保证：\r\n(i)\u201c本服务\u201d会符合您的要求；\r\n(ii)\u201c本服务\u201d不会中断，且适时、安全和不带任何错误；\r\n(iii) 通过使用\u201c本服务\u201d而可能获取的结果将是准确或可信赖的；及 \r\n(iv) 您通过\u201c本服务\u201d而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用\u201c本服务\u201d而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您通过\u201c本服务\u201d获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证。\r\n十二、 责任范围\r\n您明确理解和同意，闪电快运网不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论闪电快运网是否已被告知该等损害赔偿的可能性)：\r\n(i) 使用或未能使用\u201c本服务\u201d；\r\n(ii) 因通过或从\u201c本服务\u201d购买或获取任何货物、样品数据、资料或服务，或通过或从\u201c本服务\u201d接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；\r\n(iii) 未经批准接入或更改您的传输资料或数据；\r\n(iv) 任何第三者对\u201c服务\u201d的声明或关於\u201c服务\u201d的行为；或 \r\n(v) 因任何原因而引起的与\u201c服务\u201d有关的任何其他事宜，包括疏忽。\r\n十三、赔偿\r\n您同意，因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反了法律或侵害了第三方的权利，而使第三方对本公司及其子公司、分公司、董事、职员、代理人提出索赔要求（包括司法费用和其他专业人士的费用），您必须赔偿给本公司及其子公司、分公司、董事、职员、代理人，使其等免遭损失。\r\n十四、遵守法律\r\n您应遵守与您使用\u201c本服务\u201d，以及与您购买和销售任何物品以及提供交易信息有关的所有相关的法律、法规、条例和规章。\r\n十五、无代理关系\r\n您与闪电快运网仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇用与被雇用或特许权授予与被授予关系。\r\n十六、广告服务\r\n您与在\u201c本服务\u201d上或通过\u201c本服务\u201d物色的刊登广告人士通讯或进行业务往来或参与其推广活动，包括就相关货物或服务付款和交付相关货物或服务，以及与该等业务往来相关的任何其他条款、条件、保证或声明，仅限于在您和该刊登广告人士之间发生。您同意，对于因任何该等业务往来或因在\u201c服务\u201d上出现该等刊登广告人士而发生的任何种类的任何损失或损毁，闪电快运网无需负责或承担任何责任。\r\n十七、链接\r\n\u201c本服务\u201d或第三者均可提供与其它网站或资源的链接。由于闪电快运网并不控制其它网站和资源，您承认并同意，闪电快运网并不对其它外在网站或资源的可用性负责，且不认可其它网站或资源上或可从其它网站或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，闪电快运网均不承担责任。\r\n十八、通知\r\n除非另有明确规定，任何通知应以APP推送或手机短信的形式发送， 发送到您在登记过程中向闪电快运网提供的电子邮件地址或手机号。在推送或短信发出二十四 (24) 小时后，通知应被视为已送达。\r\n十九、不可抗力\r\n对于因本公司合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使本公司延迟或未能履约的，闪电快运网不对您承担任何责任。\r\n二十、 转让\r\n本公司转让本协议无需经您同意。\r\n二十一、其他规定\r\n本协议构成您和本公司之间的全部协议，规定了您对\u201c本服务\u201d的使用，并取代您和闪电快运网先前订立的任何书面或口头协议。本协议各方面应受中华人民共和国大陆地区法律的管辖。倘若本协议任何规定被裁定为无效或不可强制执行，该项规定应被撤销，而其余规定应予执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。本公司未就您或其他人士的某项违约行为采取行动，并不表明本公司撤回就任何继后或类似的违约事件采取行动的权利。\r\n二十二、仲裁\r\n因本协议或本公司服务所引起或与其有关的任何争议应提交乐清仲裁委员会并根据其适用的仲裁规则进行仲裁裁决。任何该等争议应单独地仲裁，不得与任何其他方的争议在任何仲裁中合并处理。仲裁应在中国浙江省乐清市进行，而仲裁裁决可提交对其有管辖权的任何法院予以强制执行。您或本公司在仲裁进行期间，可向中国浙江省乐清市内具有管辖权的法院寻求为保护您或本公司的权利或财产所需的任何临时或初步补救措施，包括但不限于财产保全或证据保全措施。 本协议项下的服务由www.lianshiding.com及其APP提供。\r\n","content":"闪电快运是国内专业物流信息服务平台, 提供同城配送、同城拉货、搬家、城市配送等整车货运服务,整合社会车辆为企业量身定制城市配送解决方案，同时也为大众用户提供面包车出租,面包车拉货,货车出租,货车拉货、租面包车、租货车等同城货运服务。让同城物流像打车一样随时随地，随传随到。"}
     */

    private int status;
    private String msg;
    private ContentBean content;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public ContentBean getContent() {
        return content;
    }

    public void setContent(ContentBean content) {
        this.content = content;
    }

    public static class ContentBean {
        /**
         * id : 4
         * name : 闪电物流科技有限公司
         * iphone : 0577-62589122
         * wecat : 15967777888
         * qq :
         * image1 : null
         * image2 : null
         * image3 : null
         * address : 浙江省乐清市
         * agree_ment :                  闪电快运《用户服务协议》
         闪电快运（以下简称本服务）是由乐清闪电网络科技有限公司（以下简称本公司）向闪电快运用户提供的软件系统（以下简称本系统）及(或)附随的运费、保险费等费用代收代付的中介服务。本协议由您和本公司签订。
         一、 接受条款
         您在闪电快运（以下简称本网站）的注册、登录、使用等行为将视为对本协议的接受即表示您已经同意与乐清闪电网络科技有限公司订立本协议，且您将受本协议的条款和条件 (“条款”) 约束。本《协议》可由本公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，您可在本网站查阅最新版协议条款。在本公司修改《协议》条款后，如果您不接受修改后的条款，请立即停止使用闪电快运提供的服务，您继续使用闪电快运提供的服务将被视为已接受了修改后的协议。当您与本公司发生争议时，应以最新的“条款”为准。
         二、服务对象
         只有符合下列条件之一的自然人或法人才能申请成为本网站会员，可以享受本网站的服务：
         2.1拥有与经营性道路运输业务相适应并经道路运输管理机构检测合格的车辆；
         2.2从事货运经营的驾驶员须取得相应的机动车驾驶证且年龄不超过60周岁；
         2.3取得道路运输管理机构颁发的道路运输经营许可证和向投入运输的车辆配发的车辆营运证。
         2.4从事危险货物运输经营的，须取得道路运输管理机构颁发的危险品道路运输经营许可证，驾驶员取得道路危险货物运输从业资格证。
         三、您的权利与义务
         3.1您及您的司机有权根据本协议及本网站发布的相关规则，利用闪电快运发布车源信息、查询货源信息、参与货源报价，参加本网站的有关活动及有权享受本网站提供的其他有关资讯及信息服务；
         3.2您须自行负责自己的会员账号和密码，且须对在会员账号密码下发生的所有活动（包括但不限于发布货源信息、网上点击同意各类协议、规则、选择车辆承运货物、电子钱包支付等）承担责任。会员有权根据需要更改登录密
         码。因会员的过错导致的任何损失由会员自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，您使用的计算机被他人侵入；
         3.3您应当向本网站提供真实准确完整的注册信息，包括但不限于司机身份证、驾驶证和车辆行驶证、车辆运营证、车队挂靠合同等。同时，您的相关资料实际变更时及时更新有关注册资料。您进一步同意其一旦将信息或
         资料在使用服务时提供，则表示同意放弃对此信息或资料所享有的隐私权、版权和相关财产权利。
         3.4您不得以任何形式擅自转让或授权他人使用自己在本网站的会员帐号；
         3.5您有义务确保在本网站上发布的车辆信息真实、准确无误，包括但不限于车辆的驾驶员；
         3.6您及您的司机对货源信息做出的报价，一旦中标，您不得以任何理由拒绝承运，包括但不限于嫌弃运费低、距离发货地较远无法在承诺的时间前往装车。
         3.7在货源信息规定的期限内，您或您的司机须前往指定的地点提取货物，在装货过程中，驾驶员应负责进行监装，对装货过程中的不当操作有责任指出并纠正，装车完毕要求发货人开具具有法律效力的出库凭证随车带走；在货
         源信息规定的期限内，将货物运到指定的地点和收货人完成交接，并要求其开具具有法律效力的入库凭证随车带走。对于货主需要返回原件签收单的，应以快递的方式将签收单原件第一时间邮寄给收件人。
         3.8您对承运的货物负有安全责任，若违反以下条款，货主要求支付相应的违约金或由此造成其他损失时，由您自行承担全部赔偿责任：
         （1）不按约定的时间和要求配车、发运，逾期达到。
         （2）将货物错运到卸货地点或收货人，应无偿运至合同规定的到货地点或收货人。
         （3）运输过程中货物灭失、短少、变质、污染、损坏，您应按货物的实际损失（包括包装费、运杂费）赔偿货主。在符合法律和协议规定条件下的运输，由于下列原因造成货物灭失、短少、变质、污染、损坏的，您不承担违
         约责任： （1）不可抗力； （2）货物本身的自然属性； （3）货物的合理损耗； （4）货主或收货方本身的过错。
         3.9您安全准时地将货物送达后有权获得运费，在运输途中发生的其他一切费用（包括但不限于过路、过桥费）全部由您负担；
         3.10您应当自行承担因交易产生或取得的相关费用，包括但不限于通讯及交易服务费，并依法纳税；
         3.11您在本网站交易中应当遵守诚实信用原则，不得以干预或操纵交易等不正当竞争方式扰乱网上交易秩序，不得从事与网上交易无关的不当行为；
         3.12您不应采取不正当手段（包括但不限于虚假需求、互换好评等方式）提高自身或他人信用度，或采用不正当手段恶意评价其他会员，降低其他会员信用度；
         3.13您承诺自己在使用本网站实施的所有行为遵守法律、法规、行政规章和本网站的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，您将自行独立承担相应的法律责任；
         3.14您在本网站网上交易过程中如与其他会员因交易产生纠纷，可以请求本网站从中予以协调处理。您如发现其他会员有违法或违反本协议的行为，可以向本网站举报；
         3.15您同意接收来自本网站的信息，包括但不限于活动信息、交易信息、促销信息等。
         3.16您同意将手机的地理位置分享给本网站，本网站有权利在您与货主达成交易后，将你的手机位置开放给货主，以便货主与您放心交易。
         四、闪电物流网及其APP仅作为交易地点
         闪电快运网及APP仅作为用户物色交易对象、就服务的交易进行协商，以及获取各类相关服务的地点。但是，本公司不能控制交易所涉及的物品/服务的质量、安全或合法性，信息的真实性或准确性，以及交易方履行其在协议项下的各项义务的能力。本公司不能也不会控制交易各方能否履行协议义务。
         五、您的资料及交易物品
         “您的资料”包括您在注册、交易或列举物品/服务过程中向本公司或其他用户提供的任何资料，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。您应对“您的资料”负全部责任，而本公司仅作为您在网上发布和刊登“您的资料”的被动渠道。但是，倘若本公司认为“您的资料”可能使本公司承担任何法律或道义上的责任，或可能使本公司 (全部或部份地) 失去本公司的互联网服务供应商或其他供应商的服务，或您未在闪电物流规定的期限内登录或再次登录网站，则本公司可自行全权决定对“您的资料”采取本公司认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给闪电快运网的“您的资料”拥有全部权利，包括全部版权。您确认，闪电快运网没有责任去认定或决定您提交给本公司的资料哪些是应当受到保护的，对享有“本服务”的其他用户使用“您的资料”，本公司也不必负责。为了保证交易的安全进行，闪电快运有义务向货主提供车主在闪电快运网注册时提交的包括但不限于 行驶证、营运证、司机、车主及车辆照片。
         5.1 注册义务 如您在闪电快运网注册，您同意：
         (a) 根据闪电快运网刊载的会员资料表格的要求，提供关于您或贵公司的真实、准确、完整和反映当前情况的资料；
         (b) 维持并及时更新会员资料，使其保持真实、准确、完整和反映当前情况。倘若您提供任何不真实、不准确、不完整或不能反映当前情况的资料，或省闪电物流网有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况，闪电快运网有权暂停或终止您的注册身份及资料，并拒绝您在目前或将来对“服务”(或其任何部份) 以任何形式使用。如您代表一家公司或其他法律主体在本公司登记，则您声明和保证，您有权使该公司或其他法律主体受本协议“条款”约束。
         5.2 会员注册名、密码和保密 在登记过程中，您将选择会员注册名和密码。您须自行负责对您的会员注册名和密码保密，且须对您在会员注册名和密码下发生的所有活动承担责任。您同意：
         (a) 如发现任何人未经授权使用您的会员注册名或密码，或发生违反保密规定的任何其他情况，您会立即通知闪电快运网；
         (b) 确保您在每个上网时段结束时，以正确步骤离开网站。闪电快运网不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。
         5.3 关于您的资料的规则 您同意，“您的资料”和您提供在闪电快运网上交易的任何“物品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据，或某种服务或行为。本协议中“物品”一词均含此义）
         a. 不会有欺诈成份；
         b. 不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权；
         c. 不会违反任何法律、法规、条例或规章 (包括但不限于保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)；
         d. 不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容；
         e. 不会含有淫秽、或包含任何儿童色情内容；
         f. 不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序；
         此外，您同意不会：在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“本服务”；未经其他人士同意，利用“本服务”收集其他人士的电话号码及其他资料；或利用“本服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士。
         六、您授予本公司的许可使用权
         您授予本公司独家的、国内通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)，使本公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示"您的资料"或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将"您的资料"纳入其他作品内。
         七、隐私
         尽管有第5条所规定的许可使用权，本公司将仅根据本公司的隐私声明使用“您的资料”。本公司隐私声明的全部条款属于本协议的一部份，因此，您必须仔细阅读。请注意，您一旦自愿地在闪电快运网交易地点披露“您的资料”，该等资料即可能被其他人士获取和使用。您同意将手机的地理位置分享给本网站，本网站有权利在认为必要的时候开放给其他第三方。
         八、交易程序
         8.1 添加产品/服务描述条目 产品/服务描述是由您提供的在闪电物流网上展示的文字描述、图画和/或照片，可以是
         (a) 对您拥有而您希望出售的产品/服务的描述；或
         (b) 对您正寻找的产品/服务的描述。您可在闪电快运网发布任一类产品/服务描述，或两种类型同时发布，条件是，您必须将该等产品/服务描述归入正确的类目内。闪电快运网不对产品/服务描述的准确性或内容负责。
         8.2 就交易进行协商 交易各方通过在闪电快运网上明确描述报价和回复，进行相互协商。所有各方接纳报价或回复将使所涉及的闪电快运网用户有义务完成交易。除非在特殊情况下，诸如用户在您提出报价后实质性地更改对物品的描述或澄清任何文字输入错误，或您未能证实交易所涉及的用户的身份等，报盘和承诺均不得撤回。
         8.3 处理交易争议 本公司不会且不能牵涉进交易各方的交易当中。倘若您与一名或一名以上用户，或与您通过本公司网站获取其服务的第三者服务供应商发生争议，您免除闪电快运网 (及本公司代理人和雇员) 在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何 (实际和后果性的) 权利主张、要求和损害赔偿等方面的责任。
         8.4 运用常识 本公司不能亦不试图对其他用户通过“本服务”提供的资料进行控制。就其本质而言，其他用户的资料，可能是令人反感的、有害的或不准确的，且在某些情况下可能带有错误的标识说明或以欺诈方式加上标识说明。本公司希望您在使用本公司网站时，小心谨慎并运用常识。
         九、信息反馈
         9.1 反馈 您不得采取任何可能损害信息反馈系统的完整性的行动，诸如：利用第二会员身份标识或第三者为您本身留下正面反馈；利用第二会员身份标识或第三者为其他用户留下负面反馈 (反馈数据轰炸)；或在用户未能履行交易范围以外的某些行动时，留下负面的反馈 (反馈恶意强加)。
         9.2 不作商业性利用 您同意，您不得对任何资料作商业性利用，包括但不限于在未经闪电快运网事先书面批准的情况下，复制在闪电快运网上展示任何资料。
         十、 终止或访问限制
         您同意，闪电快运网可自行全权决定以任何理由 (包括但不限于闪电快运认为您已违反本协议的字面意义和精神，或以不符合本协议的字面意义和精神的方式行事，或您在超过90天的时间内未以您的帐号及密码登录网站) 终止您的“本服务”密码、帐户 (或其任何部份) 或您对“本服务”的使用，并删除和丢弃您在使用“本服务”中提交的“您的资料”。闪电快运网同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供“本服务”或其任何部份。您同意，根据本协议的任何规定终止您使用“本服务”之措施可在不发出事先通知的情况下实施，并承认和同意，闪电快运网可立即使您的帐户无效，或撤销您的帐户以及在您的帐户内的所有相关资料和档案，和/或禁止您进一步接入该等档案或“服本务”。帐号终止后，闪电快运网没有义务为您保留原帐号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，闪电快运网不会就终止您接入“本服务”而对您或任何第三者承担任何责任。第11、12、13、20条应在本协议终止后继续有效。
         十一、 违反规则会有什么后果？
         11.1在不限制其他补救措施的前提下，发生下述任一情况，本公司可立即发出警告，暂时中止、永久中止或终止您的会员资格，删除您的任何现有信息，以及您在网站上展示的任何其他资料：
         (i) 您违反本协议；
         (ii) 本公司无法核实或鉴定您向本公司提供的任何资料；或
         (iii) 本公司相信您的行为可能会使您、本公司用户或通过本公司或本公司网站提供服务的第三者服务供应商发生任何法律责任。在不限制任何其他补救措施的前提下，倘若发现您从事涉及本公司网站的诈骗活动，闪电快运网可暂停或终止您的帐户。
         11.2服务“按现状”提供 本公司会尽一切努力使您在使用闪电快运网的过程中得到乐趣。遗憾的是，本公司不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用“本服务”的风险由您自行承担。“本服务”以“按现状”和“按可得到”的基础提供。闪电快运网明确声明不作出任何种类的所有明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。闪电快运网对下述内容不作保证：
         (i)“本服务”会符合您的要求；
         (ii)“本服务”不会中断，且适时、安全和不带任何错误；
         (iii) 通过使用“本服务”而可能获取的结果将是准确或可信赖的；及
         (iv) 您通过“本服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用“本服务”而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您通过“本服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证。
         十二、 责任范围
         您明确理解和同意，闪电快运网不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论闪电快运网是否已被告知该等损害赔偿的可能性)：
         (i) 使用或未能使用“本服务”；
         (ii) 因通过或从“本服务”购买或获取任何货物、样品数据、资料或服务，或通过或从“本服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；
         (iii) 未经批准接入或更改您的传输资料或数据；
         (iv) 任何第三者对“服务”的声明或关於“服务”的行为；或
         (v) 因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。
         十三、赔偿
         您同意，因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反了法律或侵害了第三方的权利，而使第三方对本公司及其子公司、分公司、董事、职员、代理人提出索赔要求（包括司法费用和其他专业人士的费用），您必须赔偿给本公司及其子公司、分公司、董事、职员、代理人，使其等免遭损失。
         十四、遵守法律
         您应遵守与您使用“本服务”，以及与您购买和销售任何物品以及提供交易信息有关的所有相关的法律、法规、条例和规章。
         十五、无代理关系
         您与闪电快运网仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇用与被雇用或特许权授予与被授予关系。
         十六、广告服务
         您与在“本服务”上或通过“本服务”物色的刊登广告人士通讯或进行业务往来或参与其推广活动，包括就相关货物或服务付款和交付相关货物或服务，以及与该等业务往来相关的任何其他条款、条件、保证或声明，仅限于在您和该刊登广告人士之间发生。您同意，对于因任何该等业务往来或因在“服务”上出现该等刊登广告人士而发生的任何种类的任何损失或损毁，闪电快运网无需负责或承担任何责任。
         十七、链接
         “本服务”或第三者均可提供与其它网站或资源的链接。由于闪电快运网并不控制其它网站和资源，您承认并同意，闪电快运网并不对其它外在网站或资源的可用性负责，且不认可其它网站或资源上或可从其它网站或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，闪电快运网均不承担责任。
         十八、通知
         除非另有明确规定，任何通知应以APP推送或手机短信的形式发送， 发送到您在登记过程中向闪电快运网提供的电子邮件地址或手机号。在推送或短信发出二十四 (24) 小时后，通知应被视为已送达。
         十九、不可抗力
         对于因本公司合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使本公司延迟或未能履约的，闪电快运网不对您承担任何责任。
         二十、 转让
         本公司转让本协议无需经您同意。
         二十一、其他规定
         本协议构成您和本公司之间的全部协议，规定了您对“本服务”的使用，并取代您和闪电快运网先前订立的任何书面或口头协议。本协议各方面应受中华人民共和国大陆地区法律的管辖。倘若本协议任何规定被裁定为无效或不可强制执行，该项规定应被撤销，而其余规定应予执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。本公司未就您或其他人士的某项违约行为采取行动，并不表明本公司撤回就任何继后或类似的违约事件采取行动的权利。
         二十二、仲裁
         因本协议或本公司服务所引起或与其有关的任何争议应提交乐清仲裁委员会并根据其适用的仲裁规则进行仲裁裁决。任何该等争议应单独地仲裁，不得与任何其他方的争议在任何仲裁中合并处理。仲裁应在中国浙江省乐清市进行，而仲裁裁决可提交对其有管辖权的任何法院予以强制执行。您或本公司在仲裁进行期间，可向中国浙江省乐清市内具有管辖权的法院寻求为保护您或本公司的权利或财产所需的任何临时或初步补救措施，包括但不限于财产保全或证据保全措施。 本协议项下的服务由www.lianshiding.com及其APP提供。

         * content : 闪电快运是国内专业物流信息服务平台, 提供同城配送、同城拉货、搬家、城市配送等整车货运服务,整合社会车辆为企业量身定制城市配送解决方案，同时也为大众用户提供面包车出租,面包车拉货,货车出租,货车拉货、租面包车、租货车等同城货运服务。让同城物流像打车一样随时随地，随传随到。
         */

        private String id;
        private String name;
        private String iphone;
        private String wecat;
        private String qq;
        private Object image1;
        private Object image2;
        private Object image3;
        private String address;
        private String agree_ment;
        private String content;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getIphone() {
            return iphone;
        }

        public void setIphone(String iphone) {
            this.iphone = iphone;
        }

        public String getWecat() {
            return wecat;
        }

        public void setWecat(String wecat) {
            this.wecat = wecat;
        }

        public String getQq() {
            return qq;
        }

        public void setQq(String qq) {
            this.qq = qq;
        }

        public Object getImage1() {
            return image1;
        }

        public void setImage1(Object image1) {
            this.image1 = image1;
        }

        public Object getImage2() {
            return image2;
        }

        public void setImage2(Object image2) {
            this.image2 = image2;
        }

        public Object getImage3() {
            return image3;
        }

        public void setImage3(Object image3) {
            this.image3 = image3;
        }

        public String getAddress() {
            return address;
        }

        public void setAddress(String address) {
            this.address = address;
        }

        public String getAgree_ment() {
            return agree_ment;
        }

        public void setAgree_ment(String agree_ment) {
            this.agree_ment = agree_ment;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
